package dev.falhad.idpay

val idPayErrors = hashMapOf(
    11 to "کاربر مسدود شده است.",
    12 to "API Key یافت نشد.",
    13 to "درخواست شما از {ip} ارسال شده است. این IP با IP های ثبت شده در وب سرویس همخوانی ندارد.",
    14 to "وب سرویس شما در حال بررسی است و یا تایید نشده است.",
    21 to "حساب بانکی متصل به وب سرویس تایید نشده است.",
    22 to "وب سریس یافت نشد.",
    23 to "اعتبار سنجی وب سرویس ناموفق بود.",
    24 to "حساب بانکی مرتبط با این وب سرویس غیر فعال شده است.",
    31 to "کد تراکنش id نباید خالی باشد.",
    32 to "شماره سفارش order_id نباید خالی باشد.",
    33 to "مبلغ amount نباید خالی باشد.",
    34 to "مبلغ amount باید بیشتر از {min-amount} ریال باشد.",
    35 to "مبلغ amount باید کمتر از {max-amount} ریال باشد.",
    36 to "مبلغ amount بیشتر از حد مجاز است.",
    37 to "آدرس بازگشت callback نباید خالی باشد.",
    38 to "درخواست شما از آدرس {domain} ارسال شده است. دامنه آدرس بازگشت callback با آدرس ثبت شده در وب سرویس همخوانی ندارد.",
    41 to "فیلتر وضعیت تراکنش ها می بایست آرایه ای (لیستی) از وضعیت های مجاز در مستندات باشد.",
    42 to "فیلتر تاریخ پرداخت می بایست آرایه ای شامل المنت های min و max از نوع timestamp باشد.",
    43 to "فیلتر تاریخ تسویه می بایست آرایه ای شامل المنت های min و max از نوع timestamp باشد.",
    51 to "تراکنش ایجاد نشد.",
    52 to "استعلام نتیجه ای نداشت.",
    53 to "تایید پرداخت امکان پذیر نیست.",
    54 to "مدت زمان تایید پرداخت سپری شده است.",

    -999 to "خطایی پیش آمد."
)


val transactionStatus = hashMapOf<Int, String>(
    1 to "پرداخت انجام نشده است",
    2 to "پرداخت ناموفق بوده است",
    3 to "خطا رخ داده است",
    4 to "بلوکه شده",
    5 to "برگشت به پرداخت کننده",
    6 to "برگشت خورده سیستمی",
    7 to "انصراف از پرداخت",
    8 to "به درگاه پرداخت منتقل شد",
    10 to "در انتظار تایید پرداخت",
    100 to "پرداخت تایید شده است",
    101 to "پرداخت قبلا تایید شده است",
    200 to "به دریافت کننده واریز شد",
)


enum class TransactionStatus(val code: Int) {
    PAYMENT_CANCELED(1),
    PAYMENT_FAILED(2),
    ERROR(3),
    BLOCKED(4),
    RETURN_TO_RECEIPT(5),
    SYSTEM_RETURN(6),
    CANCELED_BY_USER(7),
    GATEWAY(8),
    PENDING_FOR_VERIFY(10),
    VERIFIED(100),
    ALREADY_VERIFIED(101),
    PAYED(200),
}